1s/ERP/Conf/Enums/ПериодыОтсрочкиУдаленияУстаревшихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПериодыОтсрочкиУдаленияУстаревшихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Через1День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Через1Неделю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Через1Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Через3Месяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Через6Месяцев</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ПериодыОтсрочкиУдаленияУстаревшихДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДатаОтбораДляУдаления(Периодичность) Экспорт
	
	Дата = ТекущаяДатаСеанса();
	
	Если Периодичность = Через1День Тогда
		Дата = Дата - 24 * 60 * 60;
	ИначеЕсли Периодичность = Через1Неделю Тогда
		Дата = Дата - 24 * 60 * 60 * 7;
	ИначеЕсли Периодичность = Через1Месяц Тогда
		Дата = ДобавитьМесяц(Дата, -1);
	ИначеЕсли Периодичность = Через3Месяца Тогда
		Дата = ДобавитьМесяц(Дата, -3);
	ИначеЕсли Периодичность = Через6Месяцев Тогда
		Дата = ДобавитьМесяц(Дата, -6);
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции

#КонецОбласти

#КонецЕсли
